import type { Metadata } from "next";
import { Inter } from "next/font/google";
import "./globals.css";
import { Heading } from "@/components/heading";
import Header from "@/components/header";


const inter = Inter({ subsets: ["latin"] });

export const metadata: Metadata = {
  title: 'Bookhaven | Інтернет-магазин книг на будь-який смак.',
  description: 'Bookhaven - український інтернет-магазин книг для любителів читати. Ми пропонуємо великий асортимент художньої літератури різних жанрів, дитячої літератури, навчальних посібників та періодичних видань від провідних українських та зарубіжних видавництв. У нашому каталозі ви знайдете новинки, бестселери, класику та розважальні книги на будь-який смак. Зручний пошук, докладні анотації, вигідні ціни. Здійснюємо швидку доставку книг по всій території України. Bookhaven - відкрийте для себе цікавий світ книг!',
  keywords: 'Інтернет-магазин книг, Книгарня, інтернет магазин книг, Мегакнига, книги про інтернет, книги інтернет-магазин, купити книги, купити книги інтернет-магазин',
  openGraph: {
    title: 'Bookhaven | Інтернет-магазин книг на будь-який смак.',
    description: 'Bookhaven - український інтернет-магазин книг для любителів читати. Ми пропонуємо великий асортимент художньої літератури різних жанрів, дитячої літератури, навчальних посібників та періодичних видань від провідних українських та зарубіжних видавництв. У нашому каталозі ви знайдете новинки, бестселери, класику та розважальні книги на будь-який смак. Зручний пошук, докладні анотації, вигідні ціни. Здійснюємо швидку доставку книг по всій території України. Bookhaven - відкрийте для себе цікавий світ книг!',
  }
};

export default function RootLayout({
  children,
}: Readonly<{
  children: React.ReactNode;
}>) {
  return (
    <html lang="ukr">
      <body className={inter.className}>
      <Heading />
      <Header />
        <main>{children}</main>
        </body>
    </html>
  );
}
